``` sql
CREATE TABLE table_name ( col1_name col1_datatype , col2_name col2_datatype , col3_name col3_datatype );

INSERT INTO table_name VALUES (col1_value , col2_value, col3_value );
```

``` sql
CREATE TABLE cities ( id INTEGER PRIMARY KEY, name TEXT, pincode INTEGER, state TEXT);

INSERT INTO cities VALUES (1 , 'Mumbai', 400001, 'Maharashtra');

INSERT INTO cities VALUES (2 , 'Chennai', 600001, 'Tamil Nadu');

INSERT INTO cities VALUES (3 , 'Kolkata', 700001, 'West Bengal');
```

For the time being ignore the code that we have written to create above table and let's write first  query.

1) SELECT statement is used to select one or more columns from a table.

``` sql
/* this is a syntax for SELECT query
to select one or more columns */

SELECT column1, column2, ... FROM table_name 

-- to select one column

SELECT name FROM cities 
```

``` sql
-- to select multiple columns

SELECT name, pincode FROM cities 
```

``` sql
-- to select all the columns

SELECT * FROM cities 
```

SELECT statements are not case-sensitive so we can also write.

select name from cities 

But convention is to use upper case letters for keywords to differentiate from other text.

SQL aliases are used to give a table, or a column in a table, a temporary name. An alias only exists for the duration of that query. It is created with the AS keyword.

``` sql
-- alias

SELECT CONCAT(name, ', ', state, ', ', pincode, ' - ') AS Address FROM cities 

SELECT id + pincode AS new_pincode FROM cities 
```

In [ ]:
# try this - SELECT name + ' ' + state AS city_state FROM cities

These new columns created using alias are temporary so we cannot find those in original table.

``` sql
SELECT * FROM cities
```

``` sql
/* aliases for columns */

SELECT name AS city_name FROM cities

SELECT id + pincode AS new_pincode FROM cities
```

``` sql
/* aliases for table (commomnly used in JOIN statements)*/

SELECT c.state FROM cities c
```

Alias 'c' is defined for 'cities' table and used to refer column 'state' from table 'c'.

Aliases are useful when :
- more than one tables involved in a query
- column names are long and/or not readable
- more than one columns are combined together

2) INSERT statement is used to add new row to the table.

``` sql
/* this is a syntax for INSERT query
to add one row to all the columns */

INSERT INTO table_name
VALUES (col1_value, col2_value, .. colN_value) ;

```

Values to be added in row (col1_value, col2_value, .. colN_value) should be in same order and of same datatype as that of columns. Also total values added in a row must be equal to the number of columns.

``` sql
INSERT INTO cities VALUES (4, 'Bengaluru', 56001, 'Karnataka') 

SELECT * FROM cities
```

``` sql
/* this is a syntax for INSERT query
to add more rows to all the columns */

INSERT INTO table_name
VALUES (col1_value, col2_value, .. colN_value), (col1_value, col2_value, .. colN_value)... ;

INSERT INTO table_name
VALUES (5, 'Hyderabad', 50001, 'Telangana'), (6, 'Patna', 80001, 'Bihar')

SELECT * FROM cities
```

In [1]:
# output image

``` sql
/* this is a syntax for INSERT query
to add a row to specific columns */

INSERT INTO table_name (col_name1, col_name2 )
VALUES (col1_value, col2_value ) ;

INSERT INTO cities (id, name, state) VALUES (4 , 'Indore', 'Madhya Pradesh');

WE did not assign any value to the pincode column, NULL value appears there in the tabble.

SELECT * FROM cities
```